create database zhulun;

use zhulun;
-- 删除tb_brand表
drop table if exists tb_brand;
-- 创建tb_brand表
create table tb_brand
(
    -- id 主键
    id           int primary key auto_increment,
    -- 品牌名称
    brand_name   varchar(20),
    -- 企业名称
    custom_name varchar(20),
    -- 排序字段
    ordered      int,
    -- 描述信息
    tel  varchar(100),
    -- 状态：0：禁用  1：启用
    status       int
);
-- 添加数据
insert into zhulun.tb_brand (brand_name, custom_name, ordered, tel, status)
values 
       ('宝马', '张三', 100, '111111111', 1),
       ('特斯拉', '李四', 50, '555555555', 1),
       ('红旗', '王五', 30, '6666666666', 1),
       ('一汽大众', '李培林', 10, '333333333', 1),
       ('玛莎拉蒂', '王立业', 50, '555555555', 0),
       ('蔚来', '郭林权', 5, '7777777777', 0),
       ('桑塔纳', '赵哈', 40, '55656464', 1),
       ('特斯拉', '孙飒飒', 50, '884946465', 1),
       ('奥迪', '李成功', 5, '4546465', 0),
       ('宝马', '刘鲁汶', 100, '565456', 1),
       ('特斯拉', '战小小', 50, '5645645', 1),
       ('红旗', '孙撒', 30, '54596486', 1),
       ('奔驰', '刘建国', 10, '54641561561', 1),
       ('玛莎拉蒂', '赵人', 50, '45645645646', 0),
       ('蔚来', '娄子明', 5, '4645465456', 0),
       ('桑塔纳', '尚马奇', 40, '561561', 1),
       ('宝马', '高盈盈', 100, '8748484968', 1),
       ('特斯拉', '陈阵阵', 50, '56456', 1),
       ('红旗', '孙因银', 30, '1311321213213', 1),
       ('奔驰', '李响', 10, '856464', 1);
   

SELECT * FROM zhulun.tb_brand;




